namespace SchoolDisciplineApp.Domain.Enums;
public enum BehaviorType
{
    الفوضى_داخل_الفصل_أو_المدرسة,
    الشغب_في_وسائل_النقل_المدرسي,
    الخروج_المتكرر_من_الحصص,
    التأخر_عن_العودة_إلى_الصف,
    التأخر_الصباحي_بعد_نصف_ساعة,
    العبث_في_ممتلكات_المدرسة,
    العبث_في_ممتلكات_الأصدقاء,
    التفوه_بألفاظ_غير_لائقة,
    عدم_الالتزام_بالزي,
    إحضار_الممنوعات,
    عدم_الانضباط_في_الطابور,
    وضع_المساحيق,
    إصابة_طالبة_عمدًا_عن_طريق_الضرب,
    تناول_الأطعمة_في_الصف,
    عدم_النزول_في_الساحة_أثناء_الطابور_والفسحة,
    التخويف_وإثارة_الرعب_وممارسة_الألعاب,
    أخرى
}